(6400, 101, 101, 1)
(800, 101, 101, 1)
Stage 1
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 101, 101, 1)  0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 101, 101, 16) 160         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 101, 101, 16) 64          conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 101, 101, 16) 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 101, 101, 16) 2320        activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 101, 101, 16) 64          conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 101, 101, 16) 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 101, 101, 16) 2320        activation_2[0][0]               
__________________________________________________________________________________________________
add_1 (Add)                     (None, 101, 101, 16) 0           conv2d_3[0][0]                   
                                                                 conv2d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 101, 101, 16) 64          add_1[0][0]                      
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 101, 101, 16) 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 101, 101, 16) 2320        activation_3[0][0]               
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 101, 101, 16) 64          conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 101, 101, 16) 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 101, 101, 16) 2320        activation_4[0][0]               
__________________________________________________________________________________________________
add_2 (Add)                     (None, 101, 101, 16) 0           conv2d_5[0][0]                   
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 101, 101, 16) 64          add_2[0][0]                      
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 101, 101, 16) 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 50, 50, 16)   0           activation_5[0][0]               
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 50, 50, 16)   0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 50, 50, 32)   4640        dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 50, 50, 32)   128         conv2d_6[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 50, 50, 32)   0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 50, 50, 32)   9248        activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 50, 50, 32)   128         conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 50, 50, 32)   0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 50, 50, 32)   9248        activation_7[0][0]               
__________________________________________________________________________________________________
add_3 (Add)                     (None, 50, 50, 32)   0           conv2d_8[0][0]                   
                                                                 conv2d_6[0][0]                   
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 50, 50, 32)   128         add_3[0][0]                      
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 50, 50, 32)   0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 50, 50, 32)   9248        activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 50, 50, 32)   128         conv2d_9[0][0]                   
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 50, 50, 32)   0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 50, 50, 32)   9248        activation_9[0][0]               
__________________________________________________________________________________________________
add_4 (Add)                     (None, 50, 50, 32)   0           conv2d_10[0][0]                  
                                                                 add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 50, 50, 32)   128         add_4[0][0]                      
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 50, 50, 32)   0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 25, 25, 32)   0           activation_10[0][0]              
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 25, 25, 32)   0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 25, 25, 64)   18496       dropout_2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 25, 25, 64)   256         conv2d_11[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 25, 25, 64)   0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 25, 25, 64)   36928       activation_11[0][0]              
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 25, 25, 64)   256         conv2d_12[0][0]                  
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 25, 25, 64)   0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 25, 25, 64)   36928       activation_12[0][0]              
__________________________________________________________________________________________________
add_5 (Add)                     (None, 25, 25, 64)   0           conv2d_13[0][0]                  
                                                                 conv2d_11[0][0]                  
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 25, 25, 64)   256         add_5[0][0]                      
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 25, 25, 64)   0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 25, 25, 64)   36928       activation_13[0][0]              
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 25, 25, 64)   256         conv2d_14[0][0]                  
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 25, 25, 64)   0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 25, 25, 64)   36928       activation_14[0][0]              
__________________________________________________________________________________________________
add_6 (Add)                     (None, 25, 25, 64)   0           conv2d_15[0][0]                  
                                                                 add_5[0][0]                      
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 25, 25, 64)   256         add_6[0][0]                      
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 25, 25, 64)   0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 12, 12, 64)   0           activation_15[0][0]              
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 12, 12, 64)   0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 12, 12, 128)  73856       dropout_3[0][0]                  
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 12, 12, 128)  512         conv2d_16[0][0]                  
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 12, 12, 128)  0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 12, 12, 128)  147584      activation_16[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 12, 12, 128)  512         conv2d_17[0][0]                  
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 12, 12, 128)  0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 12, 12, 128)  147584      activation_17[0][0]              
__________________________________________________________________________________________________
add_7 (Add)                     (None, 12, 12, 128)  0           conv2d_18[0][0]                  
                                                                 conv2d_16[0][0]                  
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 12, 12, 128)  512         add_7[0][0]                      
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 12, 12, 128)  0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 12, 12, 128)  147584      activation_18[0][0]              
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 12, 12, 128)  512         conv2d_19[0][0]                  
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 12, 12, 128)  0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 12, 12, 128)  147584      activation_19[0][0]              
__________________________________________________________________________________________________
add_8 (Add)                     (None, 12, 12, 128)  0           conv2d_20[0][0]                  
                                                                 add_7[0][0]                      
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 12, 12, 128)  512         add_8[0][0]                      
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 12, 12, 128)  0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 6, 6, 128)    0           activation_20[0][0]              
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 6, 6, 128)    0           max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 6, 6, 256)    295168      dropout_4[0][0]                  
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 6, 6, 256)    1024        conv2d_21[0][0]                  
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 6, 6, 256)    0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 6, 6, 256)    590080      activation_21[0][0]              
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 6, 6, 256)    1024        conv2d_22[0][0]                  
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 6, 6, 256)    0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 6, 6, 256)    590080      activation_22[0][0]              
__________________________________________________________________________________________________
add_9 (Add)                     (None, 6, 6, 256)    0           conv2d_23[0][0]                  
                                                                 conv2d_21[0][0]                  
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 6, 6, 256)    1024        add_9[0][0]                      
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 6, 6, 256)    0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 6, 6, 256)    590080      activation_23[0][0]              
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 6, 6, 256)    1024        conv2d_24[0][0]                  
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 6, 6, 256)    0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 6, 6, 256)    590080      activation_24[0][0]              
__________________________________________________________________________________________________
add_10 (Add)                    (None, 6, 6, 256)    0           conv2d_25[0][0]                  
                                                                 add_9[0][0]                      
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 6, 6, 256)    1024        add_10[0][0]                     
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 6, 6, 256)    0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 12, 12, 128)  295040      activation_25[0][0]              
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 12, 12, 256)  0           conv2d_transpose_1[0][0]         
                                                                 activation_20[0][0]              
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 12, 12, 256)  0           concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 12, 12, 128)  295040      dropout_5[0][0]                  
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 12, 12, 128)  512         conv2d_26[0][0]                  
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 12, 12, 128)  0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 12, 12, 128)  147584      activation_26[0][0]              
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 12, 12, 128)  512         conv2d_27[0][0]                  
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 12, 12, 128)  0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 12, 12, 128)  147584      activation_27[0][0]              
__________________________________________________________________________________________________
add_11 (Add)                    (None, 12, 12, 128)  0           conv2d_28[0][0]                  
                                                                 conv2d_26[0][0]                  
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 12, 12, 128)  512         add_11[0][0]                     
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 12, 12, 128)  0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 12, 12, 128)  147584      activation_28[0][0]              
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 12, 12, 128)  512         conv2d_29[0][0]                  
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 12, 12, 128)  0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 12, 12, 128)  147584      activation_29[0][0]              
__________________________________________________________________________________________________
add_12 (Add)                    (None, 12, 12, 128)  0           conv2d_30[0][0]                  
                                                                 add_11[0][0]                     
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 12, 12, 128)  512         add_12[0][0]                     
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 12, 12, 128)  0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 25, 25, 64)   73792       activation_30[0][0]              
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 25, 25, 128)  0           conv2d_transpose_2[0][0]         
                                                                 activation_15[0][0]              
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 25, 25, 128)  0           concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 25, 25, 64)   73792       dropout_6[0][0]                  
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 25, 25, 64)   256         conv2d_31[0][0]                  
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 25, 25, 64)   0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 25, 25, 64)   36928       activation_31[0][0]              
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 25, 25, 64)   256         conv2d_32[0][0]                  
__________________________________________________________________________________________________
activation_32 (Activation)      (None, 25, 25, 64)   0           batch_normalization_32[0][0]     
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 25, 25, 64)   36928       activation_32[0][0]              
__________________________________________________________________________________________________
add_13 (Add)                    (None, 25, 25, 64)   0           conv2d_33[0][0]                  
                                                                 conv2d_31[0][0]                  
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 25, 25, 64)   256         add_13[0][0]                     
__________________________________________________________________________________________________
activation_33 (Activation)      (None, 25, 25, 64)   0           batch_normalization_33[0][0]     
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 25, 25, 64)   36928       activation_33[0][0]              
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 25, 25, 64)   256         conv2d_34[0][0]                  
__________________________________________________________________________________________________
activation_34 (Activation)      (None, 25, 25, 64)   0           batch_normalization_34[0][0]     
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 25, 25, 64)   36928       activation_34[0][0]              
__________________________________________________________________________________________________
add_14 (Add)                    (None, 25, 25, 64)   0           conv2d_35[0][0]                  
                                                                 add_13[0][0]                     
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 25, 25, 64)   256         add_14[0][0]                     
__________________________________________________________________________________________________
activation_35 (Activation)      (None, 25, 25, 64)   0           batch_normalization_35[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 50, 50, 32)   18464       activation_35[0][0]              
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 50, 50, 64)   0           conv2d_transpose_3[0][0]         
                                                                 activation_10[0][0]              
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 50, 50, 64)   0           concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 50, 50, 32)   18464       dropout_7[0][0]                  
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 50, 50, 32)   128         conv2d_36[0][0]                  
__________________________________________________________________________________________________
activation_36 (Activation)      (None, 50, 50, 32)   0           batch_normalization_36[0][0]     
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 50, 50, 32)   9248        activation_36[0][0]              
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, 50, 50, 32)   128         conv2d_37[0][0]                  
__________________________________________________________________________________________________
activation_37 (Activation)      (None, 50, 50, 32)   0           batch_normalization_37[0][0]     
__________________________________________________________________________________________________
conv2d_38 (Conv2D)              (None, 50, 50, 32)   9248        activation_37[0][0]              
__________________________________________________________________________________________________
add_15 (Add)                    (None, 50, 50, 32)   0           conv2d_38[0][0]                  
                                                                 conv2d_36[0][0]                  
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, 50, 50, 32)   128         add_15[0][0]                     
__________________________________________________________________________________________________
activation_38 (Activation)      (None, 50, 50, 32)   0           batch_normalization_38[0][0]     
__________________________________________________________________________________________________
conv2d_39 (Conv2D)              (None, 50, 50, 32)   9248        activation_38[0][0]              
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (None, 50, 50, 32)   128         conv2d_39[0][0]                  
__________________________________________________________________________________________________
activation_39 (Activation)      (None, 50, 50, 32)   0           batch_normalization_39[0][0]     
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, 50, 50, 32)   9248        activation_39[0][0]              
__________________________________________________________________________________________________
add_16 (Add)                    (None, 50, 50, 32)   0           conv2d_40[0][0]                  
                                                                 add_15[0][0]                     
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, 50, 50, 32)   128         add_16[0][0]                     
__________________________________________________________________________________________________
activation_40 (Activation)      (None, 50, 50, 32)   0           batch_normalization_40[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 101, 101, 16) 4624        activation_40[0][0]              
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 101, 101, 32) 0           conv2d_transpose_4[0][0]         
                                                                 activation_5[0][0]               
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 101, 101, 32) 0           concatenate_4[0][0]              
__________________________________________________________________________________________________
conv2d_41 (Conv2D)              (None, 101, 101, 16) 4624        dropout_8[0][0]                  
__________________________________________________________________________________________________
batch_normalization_41 (BatchNo (None, 101, 101, 16) 64          conv2d_41[0][0]                  
__________________________________________________________________________________________________
activation_41 (Activation)      (None, 101, 101, 16) 0           batch_normalization_41[0][0]     
__________________________________________________________________________________________________
conv2d_42 (Conv2D)              (None, 101, 101, 16) 2320        activation_41[0][0]              
__________________________________________________________________________________________________
batch_normalization_42 (BatchNo (None, 101, 101, 16) 64          conv2d_42[0][0]                  
__________________________________________________________________________________________________
activation_42 (Activation)      (None, 101, 101, 16) 0           batch_normalization_42[0][0]     
__________________________________________________________________________________________________
conv2d_43 (Conv2D)              (None, 101, 101, 16) 2320        activation_42[0][0]              
__________________________________________________________________________________________________
add_17 (Add)                    (None, 101, 101, 16) 0           conv2d_43[0][0]                  
                                                                 conv2d_41[0][0]                  
__________________________________________________________________________________________________
batch_normalization_43 (BatchNo (None, 101, 101, 16) 64          add_17[0][0]                     
__________________________________________________________________________________________________
activation_43 (Activation)      (None, 101, 101, 16) 0           batch_normalization_43[0][0]     
__________________________________________________________________________________________________
conv2d_44 (Conv2D)              (None, 101, 101, 16) 2320        activation_43[0][0]              
__________________________________________________________________________________________________
batch_normalization_44 (BatchNo (None, 101, 101, 16) 64          conv2d_44[0][0]                  
__________________________________________________________________________________________________
activation_44 (Activation)      (None, 101, 101, 16) 0           batch_normalization_44[0][0]     
__________________________________________________________________________________________________
conv2d_45 (Conv2D)              (None, 101, 101, 16) 2320        activation_44[0][0]              
__________________________________________________________________________________________________
add_18 (Add)                    (None, 101, 101, 16) 0           conv2d_45[0][0]                  
                                                                 add_17[0][0]                     
__________________________________________________________________________________________________
batch_normalization_45 (BatchNo (None, 101, 101, 16) 64          add_18[0][0]                     
__________________________________________________________________________________________________
activation_45 (Activation)      (None, 101, 101, 16) 0           batch_normalization_45[0][0]     
__________________________________________________________________________________________________
conv2d_46 (Conv2D)              (None, 101, 101, 1)  17          activation_45[0][0]              
__________________________________________________________________________________________________
activation_46 (Activation)      (None, 101, 101, 1)  0           conv2d_46[0][0]                  
==================================================================================================
Total params: 5,119,857
Trainable params: 5,112,497
Non-trainable params: 7,360
__________________________________________________________________________________________________
Train on 6400 samples, validate on 800 samples
Epoch 1/10
 - 2307s - loss: 0.3595 - my_iou_metric: 0.3674 - val_loss: 0.6009 - val_my_iou_metric: 0.2154

Epoch 00001: val_my_iou_metric improved from -inf to 0.21537, saving model to Unet_resnet_v1_1.model
Epoch 2/10
 - 2424s - loss: 0.2766 - my_iou_metric: 0.5058 - val_loss: 0.3745 - val_my_iou_metric: 0.3724

Epoch 00002: val_my_iou_metric improved from 0.21537 to 0.37237, saving model to Unet_resnet_v1_1.model
Epoch 3/10
 - 2403s - loss: 0.2452 - my_iou_metric: 0.5494 - val_loss: 0.8235 - val_my_iou_metric: 0.3622

Epoch 00003: val_my_iou_metric did not improve from 0.37237
Epoch 4/10
 - 2424s - loss: 0.2355 - my_iou_metric: 0.5611 - val_loss: 0.3038 - val_my_iou_metric: 0.4791

Epoch 00004: val_my_iou_metric improved from 0.37237 to 0.47913, saving model to Unet_resnet_v1_1.model
Epoch 5/10
 - 2436s - loss: 0.2145 - my_iou_metric: 0.5933 - val_loss: 0.2974 - val_my_iou_metric: 0.6087

Epoch 00005: val_my_iou_metric improved from 0.47913 to 0.60875, saving model to Unet_resnet_v1_1.model
Epoch 6/10
 - 2415s - loss: 0.1941 - my_iou_metric: 0.6188 - val_loss: 0.2150 - val_my_iou_metric: 0.5763

Epoch 00006: val_my_iou_metric did not improve from 0.60875
Epoch 7/10
 - 2547s - loss: 0.1929 - my_iou_metric: 0.6248 - val_loss: 0.3102 - val_my_iou_metric: 0.5329

Epoch 00007: val_my_iou_metric did not improve from 0.60875
Epoch 8/10
 - 2645s - loss: 0.1891 - my_iou_metric: 0.6360 - val_loss: 0.1830 - val_my_iou_metric: 0.6756

Epoch 00008: val_my_iou_metric improved from 0.60875 to 0.67562, saving model to Unet_resnet_v1_1.model
Epoch 9/10
 - 2634s - loss: 0.1817 - my_iou_metric: 0.6476 - val_loss: 0.1895 - val_my_iou_metric: 0.6669

Epoch 00009: val_my_iou_metric did not improve from 0.67562
Epoch 10/10
 - 2547s - loss: 0.1661 - my_iou_metric: 0.6683 - val_loss: 0.1879 - val_my_iou_metric: 0.6193

Epoch 00010: val_my_iou_metric did not improve from 0.67562
Stage 2
Train on 6400 samples, validate on 800 samples
Epoch 1/10
 - 2699s - loss: -5.3927e-01 - my_iou_metric: 0.5045 - val_loss: -6.2262e-01 - val_my_iou_metric: 0.6154

Epoch 00001: val_my_iou_metric did not improve from 0.67562
Epoch 2/10
 - 2563s - loss: -6.3637e-01 - my_iou_metric: 0.5750 - val_loss: -6.7379e-01 - val_my_iou_metric: 0.6295

Epoch 00002: val_my_iou_metric did not improve from 0.67562
Epoch 3/10
 - 2548s - loss: -6.6867e-01 - my_iou_metric: 0.5982 - val_loss: -5.7147e-01 - val_my_iou_metric: 0.5976

Epoch 00003: val_my_iou_metric did not improve from 0.67562
Epoch 4/10
 - 2533s - loss: -7.0277e-01 - my_iou_metric: 0.6389 - val_loss: -6.4307e-01 - val_my_iou_metric: 0.6221

Epoch 00004: val_my_iou_metric did not improve from 0.67562
Epoch 5/10
 - 2436s - loss: -7.1246e-01 - my_iou_metric: 0.6401 - val_loss: -7.0912e-01 - val_my_iou_metric: 0.5839

Epoch 00005: val_my_iou_metric did not improve from 0.67562
Epoch 6/10
 - 2496s - loss: -7.3510e-01 - my_iou_metric: 0.6671 - val_loss: -6.0356e-01 - val_my_iou_metric: 0.6135

Epoch 00006: val_my_iou_metric did not improve from 0.67562
Epoch 7/10
 - 2507s - loss: -7.3554e-01 - my_iou_metric: 0.6723 - val_loss: -7.0727e-01 - val_my_iou_metric: 0.6504

Epoch 00007: val_my_iou_metric did not improve from 0.67562
Epoch 8/10
 - 2503s - loss: -7.5242e-01 - my_iou_metric: 0.6820 - val_loss: -7.3483e-01 - val_my_iou_metric: 0.7004

Epoch 00008: val_my_iou_metric improved from 0.67562 to 0.70038, saving model to Unet_resnet_v1_1.model
Epoch 9/10
 - 2483s - loss: -7.5873e-01 - my_iou_metric: 0.6945 - val_loss: -6.6214e-01 - val_my_iou_metric: 0.6593

Epoch 00009: val_my_iou_metric did not improve from 0.70038
Epoch 10/10
 - 2492s - loss: -7.6327e-01 - my_iou_metric: 0.7058 - val_loss: -7.2479e-01 - val_my_iou_metric: 0.6996

Epoch 00010: val_my_iou_metric did not improve from 0.70038
Stage 3
Train on 6400 samples, validate on 800 samples
Epoch 1/10
 - 2527s - loss: 0.1249 - my_iou_metric: 0.5980 - val_loss: 0.3356 - val_my_iou_metric: 0.6039

Epoch 00001: val_my_iou_metric did not improve from 0.70038
Epoch 2/10
 - 2593s - loss: -5.3444e-02 - my_iou_metric: 0.6258 - val_loss: -1.0343e-01 - val_my_iou_metric: 0.6231

Epoch 00002: val_my_iou_metric did not improve from 0.70038
Epoch 3/10
 - 2534s - loss: -1.2991e-01 - my_iou_metric: 0.6390 - val_loss: -2.4771e-01 - val_my_iou_metric: 0.6951

Epoch 00003: val_my_iou_metric did not improve from 0.70038
Epoch 4/10
 - 2141s - loss: -1.7572e-01 - my_iou_metric: 0.6627 - val_loss: -1.1991e-01 - val_my_iou_metric: 0.6806

Epoch 00004: val_my_iou_metric did not improve from 0.70038
Epoch 5/10
 - 2137s - loss: -2.3527e-01 - my_iou_metric: 0.6767 - val_loss: -2.2720e-01 - val_my_iou_metric: 0.6901

Epoch 00005: val_my_iou_metric did not improve from 0.70038
Epoch 6/10
 - 2130s - loss: -2.4228e-01 - my_iou_metric: 0.6800 - val_loss: -5.1456e-02 - val_my_iou_metric: 0.6451

Epoch 00006: val_my_iou_metric did not improve from 0.70038
Epoch 7/10
 - 2137s - loss: -2.6496e-01 - my_iou_metric: 0.6882 - val_loss: -2.1933e-01 - val_my_iou_metric: 0.6926

Epoch 00007: val_my_iou_metric did not improve from 0.70038
Epoch 8/10
 - 2139s - loss: -2.8349e-01 - my_iou_metric: 0.6957 - val_loss: -2.6460e-01 - val_my_iou_metric: 0.7121

Epoch 00008: val_my_iou_metric improved from 0.70038 to 0.71212, saving model to Unet_resnet_v1_1.model
Epoch 9/10
 - 2147s - loss: -3.0860e-01 - my_iou_metric: 0.7040 - val_loss: -3.1754e-01 - val_my_iou_metric: 0.7159

Epoch 00009: val_my_iou_metric improved from 0.71212 to 0.71588, saving model to Unet_resnet_v1_1.model
Epoch 10/10
 - 2177s - loss: -2.9721e-01 - my_iou_metric: 0.6990 - val_loss: -3.3557e-01 - val_my_iou_metric: 0.7260

Epoch 00010: val_my_iou_metric improved from 0.71588 to 0.72600, saving model to Unet_resnet_v1_1.model
Intersection-over-Union values for different thresholds are listed below
[0.133125 0.133125 0.133125 0.133125 0.133125 0.133125 0.133125 0.133125
 0.133125 0.133125 0.133125 0.133125 0.133125 0.133125 0.133125 0.133125
 0.51525  0.606    0.631    0.637125 0.64075  0.648375 0.65275  0.653625
 0.65325  0.655375 0.657875 0.653625 0.653875 0.651375 0.645875]
Usedtime = 8.400719404220581 s
Total run time = 21.081168919139436 hours
